src/cf/Enums/ВариантыШириныВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыШириныВиджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Узкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуторный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Широкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОченьШирокий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыШириныВиджетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет ширину виджета из варианта ширины.
//
// Параметры:
//  ВариантШирины - ПеречислениеСсылка.ВариантыШириныВиджетов - Вариант ширины виджета.
// 
// Возвращаемое значение:
//  Число - Ширина виджета указанного варианта.
//
Функция ШиринаВиджета(ВариантШирины) Экспорт
	
	Если ВариантШирины = Узкий Тогда
		
		Возврат 10;
		
	ИначеЕсли ВариантШирины = Обычный Тогда
		
		Возврат 23;
		
	ИначеЕсли ВариантШирины = Полуторный Тогда
		
		Возврат 34;
		
	ИначеЕсли ВариантШирины = Широкий Тогда
		
		Возврат 47;
		
	ИначеЕсли ВариантШирины = ОченьШирокий Тогда
		
		Возврат 71;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный вариант ширины виджета %1.'"),
			ВариантШирины);
		
	КонецЕсли;
	
КонецФункции

// Определяет ширину диаграммы из варианта ширины.
//
// Параметры:
//  ВариантШирины - ПеречислениеСсылка.ВариантыШириныВиджетов - Вариант ширины диаграммы.
// 
// Возвращаемое значение:
//  Число - Ширина диаграммы указанного варианта.
//
Функция ШиринаДиаграммы(ВариантШирины) Экспорт
	
	Если ВариантШирины = Узкий Тогда
		
		Возврат 15;
		
	ИначеЕсли ВариантШирины = Обычный Тогда
		
		Возврат 23;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неизвестный вариант ширины диаграммы %1.'"),
			ВариантШирины);
		
	КонецЕсли;

	
КонецФункции

#КонецОбласти

#КонецЕсли
